history-of-cryptography.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-30 Mon 22:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Histoire de la cryptographie</title>
<meta name="generator" content="Org mode" />
<link href="solarized-light.min.css" rel="stylesheet"></link>
</head>
<body>
<div id="content">
<h1 class="title">Histoire de la cryptographie</h1>

<div id="outline-container-org0020463" class="outline-2">
<h2 id="org0020463">L'art du secret</h2>
<div class="outline-text-2" id="text-org0020463">
</div>
<div id="outline-container-org3cbe7e5" class="outline-3">
<h3 id="org3cbe7e5">Prehistoire</h3>
<div class="outline-text-3" id="text-org3cbe7e5">
</div>
<div id="outline-container-org51b90bd" class="outline-4">
<h4 id="org51b90bd">Langues et alphabets</h4>
<div class="outline-text-4" id="text-org51b90bd">
<p>
Une première mesure pour garder une information secrete est d'utiliser un support
(langue orale ou alphabet écrit) qui n'est pas connu de ceux dont ont veut garder
le message secret
</p>
</div>
</div>

<div id="outline-container-orgdf8953d" class="outline-4">
<h4 id="orgdf8953d">Écriture en miroir (écriture spéculaire)</h4>
<div class="outline-text-4" id="text-orgdf8953d">
<p>
Le message est écrit dans l'ordre inverse du sens de lecture normal.
</p>

<p>
Les lettre sont également inversés. On peut s'aider d'un miroir pour déchiffrer le texte.
</p>
</div>
</div>

<div id="outline-container-org80206f6" class="outline-4">
<h4 id="org80206f6">Chiffre de César</h4>
</div>

<div id="outline-container-org3d5c5c3" class="outline-4">
<h4 id="org3d5c5c3">Chiffre de Vigenère</h4>
</div>
</div>


<div id="outline-container-org726bcda" class="outline-3">
<h3 id="org726bcda">History</h3>
<div class="outline-text-3" id="text-org726bcda">
</div>
<div id="outline-container-org0fd3d2e" class="outline-4">
<h4 id="org0fd3d2e">Enigma</h4>
</div>

<div id="outline-container-org4b41747" class="outline-4">
<h4 id="org4b41747">PGP (1991)</h4>
</div>
</div>


<div id="outline-container-org08bef54" class="outline-3">
<h3 id="org08bef54">Les réseau sociaux</h3>
<div class="outline-text-3" id="text-org08bef54">
<p>
Signal, Télégram, Matrix, Berty
((Basés plutot sur la cryptographie))
BitTorrent, Scuttlebutt, IPFS, Bitcoin, Ethereum, Ring, BitMessage
Diaspora, ActivityPub (Mastodont, <b>faire la liste, ou social.party</b>)
((Basés sur la décentralisation et les réseaux distribués)
</p>
</div>
</div>
</div>



<div id="outline-container-org48983ee" class="outline-2">
<h2 id="org48983ee">Algorithmes</h2>
<div class="outline-text-2" id="text-org48983ee">
</div>
<div id="outline-container-orgaccbaeb" class="outline-3">
<h3 id="orgaccbaeb">Masque jetable</h3>
</div>


<div id="outline-container-orgb7f2344" class="outline-3">
<h3 id="orgb7f2344">Chiffrement symétrique</h3>
<div class="outline-text-3" id="text-orgb7f2344">
<ul class="org-ul">
<li>Clef de chiffrement et clef (identique) de dechiffrement
C'est la cryptographie symmetrique</li>
<li>Clef de chiffrement et clef (différente) de dechiffrement
C'est la cryptographie asymetrique de chiffrement</li>
<li>Clef de signature et clef (différente) de verification
C'est la cryptographie asymmetrique de signature</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgb8878f6" class="outline-2">
<h2 id="orgb8878f6">Cryptanalyse</h2>
<div class="outline-text-2" id="text-orgb8878f6">
</div>
<div id="outline-container-org4b58e52" class="outline-3">
<h3 id="org4b58e52">Force brute</h3>
<div class="outline-text-3" id="text-org4b58e52">
<p>
Tester toutes les combinaisons possibles.
</p>
</div>
</div>


<div id="outline-container-orgafc5e58" class="outline-3">
<h3 id="orgafc5e58">Analyse fréquentielle</h3>
<div class="outline-text-3" id="text-orgafc5e58">
<p>
Dans une langue donnée, certaines lettres et combinaise de lettres apparaissent
plus ou moins souvent. C'est ce qui permet l'analyse fréquentielle.
</p>

<p>
Elle est très efficace sur le chiffrement par substitution
comme le <b>chiffre de César</b> ou le <b>chiffre de Vigenère</b>.
</p>

<p>
Plus le texte est long, plus elle est facile.
</p>
</div>
</div>


<div id="outline-container-orgad6724f" class="outline-3">
<h3 id="orgad6724f">Cryptanalyse linéaire</h3>
</div>


<div id="outline-container-org9b23381" class="outline-3">
<h3 id="org9b23381">Cryptanalyse différentielle</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-03-30 Mon 22:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
